---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DimensionSegmentArray
source: html/92bb4a0d-794e-d250-c9ae-b74db19affda.htm
---
# DimensionSegmentArray Members

Initializes a new instance of the DimensionSegmentArray class